In [1]:
import numpy as np
import pandas as pd

#### Loading the CSV data into a DataFrame

In [2]:
salaries_data = pd.read_csv("Data/Salaries.csv")
salaries_data.head(2)

C:\Users\riyaj\AppData\Local\Temp\ipykernel_51172\3048989902.py:1: DtypeWarning: Columns (0: BasePay, 1: OvertimePay, 2: OtherPay, 3: Benefits, 4: Status) have mixed types. Specify dtype option on import or set low_memory=False.
  salaries_data = pd.read_csv("Data/Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

#### Getting to know the MESSY data!

In [3]:
print(f"Shape: {salaries_data.shape}")
print(f"Columns: {salaries_data.columns}")

Shape: (148654, 13)
Columns: Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='str')

In [4]:
salaries_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  str
 2   JobTitle          148654 non-null  str
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  str
 12  Status            38119 non-null   str
dtypes: float64(3), int64(2), object(4), str(4)
memory usage: 14.7+ MB

In [5]:
salaries_data.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [6]:
salaries_data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [7]:
# Dropping unnecessary columns!!
# Notes - it does not haev any non null values
# Status - most of its data is missing (~74%) so it is useless for us

salaries_data = salaries_data.drop(columns=["Notes", "Status"])
salaries_data.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,San Francisco

In [8]:
print(f"Unique values in BasePay Column: {salaries_data['BasePay'].unique()}")
print(f"Unique values in OvertimePay Column: {salaries_data['OvertimePay'].unique()}")
print(f"Unique values in OtherPay Column: {salaries_data['OtherPay'].unique()}")
print(f"Unique values in Benefits Column: {salaries_data['Benefits'].unique()}")

Unique values in BasePay Column: [167411.18 155966.02 212739.13 ... '6.04' '15.50' 'Not Provided']
Unique values in OvertimePay Column: [0.0 245131.88 106088.18 ... '102.70' '56.77' 'Not Provided']
Unique values in OtherPay Column: [400184.25 137811.38 16452.6 ... '13.35' 'Not Provided' '-618.13']
Unique values in Benefits Column: [nan 44430.12 69810.19 ... '0.13' '1.24' 'Not Provided']

#### Data Cleaning
Upon inspecting the dataset, I observed that the columns
BasePay, OvertimePay, OtherPay, and Benefits contain mixed data types.

These columns include:

- valid numeric values
- numeric values stored as strings
- placeholder strings such as "Not Provided"
- missing values (NaN)

Since these columns represent monetary values, they should ideally contain only numeric data. So, numeric strings should be converted to atcual numeric values and "Not Provided" should be replaced with NaN values!

In [9]:
# Cleaing Salary Columns
salary_cols = ["BasePay", "OvertimePay", "OtherPay", "Benefits"]

# Changing 'Not Provided' with NaN
salaries_data[salary_cols] = salaries_data[salary_cols].replace("Not Provided", np.nan)

# Changing string numbers to integers
salaries_data[salary_cols] = salaries_data[salary_cols].apply(pd.to_numeric, errors="coerce")

In [10]:
# The problematic columns have been changed to float64 data type successfully!
salaries_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  str
 2   JobTitle          148654 non-null  str
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  str
dtypes: float64(6), int64(2), str(3)
memory usage: 12.5 MB

In [11]:
salaries_data.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000

#### Find the top 5 most occured Employee names in the dataset

In [12]:
salaries_data["EmployeeName"].value_counts()[:5]

EmployeeName
Kevin Lee       13
Steven Lee      11
William Wong    11
Richard Lee     11
KEVIN LEE        9
Name: count, dtype: int64

#### Find number of unique job titles

In [13]:
salaries_data["JobTitle"].nunique()

2159

#### Find the total number of job titles that contain Captain

In [14]:
mask = salaries_data["JobTitle"].str.contains("captain", case=False)
salaries_data[mask].shape[0]

552

#### Display all the employee names from the fire department

In [15]:
mask = salaries_data["JobTitle"].str.contains("fire", case=False)
salaries_data[mask]["EmployeeName"].unique()

<StringArray>
[     'PATRICK GARDNER',            'ALSON LEE',       'MICHAEL MORRIS',
   'JOANNE HAYES-WHITE',        'ARTHUR KENNEY',       'DAVID FRANKLIN',
           'MARTY ROSS',        'GEORGE GARCIA',        'VICTOR WYRSCH',
      'JOSEPH DRISCOLL',
 ...
     'George D Aguirre',      'Ernest E Hayles', 'Aileen Nya T Bechard',
           'Barry G Ng',        'Roger C Blume',    'Stephana Mcclaran',
      'Antoine E Davis',       'Kari A Johnson',         'Sheryl K Lee',
      'Lawrence F Gatt']
Length: 4545, dtype: str

#### Find minimum, maximum and average BasePay

In [16]:
salaries_data.describe().loc[["min", "max", "mean"], ["BasePay"]]

           BasePay
min     -166.01000
max   319275.01000
mean   66325.44884

#### Replace 'Not Provided' in EmployeeName's Column to NaN

In [17]:
salaries_data["EmployeeName"] = salaries_data["EmployeeName"].replace("Not provided", np.nan)

# checking if the replace method worked properly or not
salaries_data["EmployeeName"][salaries_data["EmployeeName"] == "Not provided"].shape[0]

0

#### Drop the rows having more than or equal to 5 missing values

In [18]:
# Displaying all the rows with more than or equal to 5 missing plues
row_with_more_than_5_null = salaries_data[salaries_data.isna().sum(axis=1) >= 5]
row_with_more_than_5_null

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
148646,148647,NaN,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014,San Francisco
148650,148651,NaN,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014,San Francisco
148651,148652,NaN,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014,San Francisco
148652,148653,NaN,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014,San Francisco

In [19]:
row_with_more_than_5_null.index

Index([148646, 148650, 148651, 148652], dtype='int64')

In [20]:
# Dropping the required rows
indices_to_drop = row_with_more_than_5_null.index
salaries_data = salaries_data.drop(index=indices_to_drop)

In [21]:
# Checking whether the rows have been dropped or not
row_with_more_than_5_null = salaries_data[salaries_data.isna().sum(axis=1) >= 5]
row_with_more_than_5_null.shape[0]

0

#### Find the job title of ALBERT PARDINI

In [22]:
mask = salaries_data['EmployeeName'].str.match("ALBERT PARDINI")
salaries_data[mask]["JobTitle"]

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: str

#### How much does ALBERT PARDINI make (Including Benefits)?

In [23]:
# Without using TotalPay column 
mask = salaries_data['EmployeeName'].str.match("ALBERT PARDINI")
salary_cols = ["BasePay", "OvertimePay", "OtherPay", "Benefits"]
salaries_data[mask][salary_cols].sum(axis=1)

2    335279.91
dtype: float64

In [24]:
# Using TotalPay column
mask = salaries_data['EmployeeName'].str.match("ALBERT PARDINI")
salaries_data[mask]["TotalPay"]

2    335279.91
Name: TotalPay, dtype: float64

#### Display the name of the person having the highest BasePay

In [25]:
max_base_pay = salaries_data["BasePay"].max()
salaries_data[salaries_data["BasePay"] == max_base_pay]["EmployeeName"]

72925    Gregory P Suhr
Name: EmployeeName, dtype: str

#### Find average BasePay of all employees per year

In [26]:
salaries_data.groupby(by="Year")["BasePay"].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

#### Find average BasePay of all employees per job title

In [27]:
salaries_data.groupby("JobTitle")["BasePay"].mean()

JobTitle
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
ACUPUNCTURIST                                     66374.400000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2158, dtype: float64

#### Find average BasePay of Employees having job title as Accountant

In [28]:
mask = salaries_data["JobTitle"].str.contains("Accountant", case=False)
salaries_data[mask]["BasePay"].mean()

np.float64(72245.57241071429)

#### Find top 5 most common jobs

In [29]:
salaries_data["JobTitle"].value_counts().head()

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64